app/views/users/index.html.erb

SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 1 AND `roles`.`name` = 'SuperAdmin' LIMIT 1
---
                    </p>
                    <span class="type"><%=u.roles.first.name%></span>