app/controllers/uploads_controller.rb

  def index
    @uploads = Upload.all
---
SELECT `uploads`.* FROM `uploads`

  def show
    @upload = Upload.find(params[:id])
---
SELECT `uploads`.* FROM `uploads` WHERE `uploads`.`id` = ? LIMIT 1  [["id", "1"]]

  def create
    @upload = Upload.new(params[:upload])
    if @upload.save
---
INSERT INTO `uploads` (`created_at`, `updated_at`, `upload_content_type`, `upload_file_name`, `upload_file_size`, `upload_updated_at`) VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @upload = Upload.find(params[:id])
    @upload.destroy
---
SELECT `uploads`.* FROM `uploads` WHERE `uploads`.`id` = ? LIMIT 1  [["id", "2"]]
DELETE FROM `uploads` WHERE `uploads`.`id` = ?  [["id", 2]]