app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
    @user_obj = User.find(params[:id])

INSERT INTO `users` (`active`, `company`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `last_login`, `last_sign_in_at`, `last_sign_in_ip`, `login_page`, `notes`, `phone_number`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `role_title`, `sign_in_count`, `title`, `updated_at`, `user_identity`, `username`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    params[:user][:addresses]=[params[:user][:addresses1]] << params[:user][:addresses2]